InformationRegisters/МегаЛогист_СохраненныеАдреса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>МегаЛогист_СохраненныеАдреса</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Широта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Долгота</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПредставлениеАдреса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/МегаЛогист_СохраненныеАдреса/Forms/ФормаЗагрузки/Ext/Form/Module.bsl
&НаСервере
Процедура ЗагрузитьНаСервере()
	
	Строка = 2;
	Пока Истина Цикл
		
		Если Не ЗначениеЗаполнено(ТабличныйДокумент.Область("R" + Формат(Строка, "ЧГ=0") +"C1").Текст) Тогда
			Прервать;
		КонецЕсли;
		ОбработкаЛогиста = Обработки.МегаЛогист_РабочееМестоЛогиста.Создать();
		Адрес = ОбработкаЛогиста.ПривестиАдресДляПоиска(ТабличныйДокумент.Область("R" + Формат(Строка, "ЧГ=0") +"C1").Текст);
		МенеджерЗаписи = РегистрыСведений.МегаЛогист_СохраненныеАдреса.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ПредставлениеАдреса = Адрес;
		МенеджерЗаписи.Прочитать();
		МенеджерЗаписи.ПредставлениеАдреса 	= Адрес;
		МенеджерЗаписи.Широта				= ТабличныйДокумент.Область("R" + Формат(Строка, "ЧГ=0") +"C2").Текст;
		МенеджерЗаписи.Долгота				= ТабличныйДокумент.Область("R" + Формат(Строка, "ЧГ=0") +"C3").Текст;
		МенеджерЗаписи.Записать();
	    Строка = Строка + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Макет = РегистрыСведений.МегаЛогист_СохраненныеАдреса.ПолучитьМакет("МакетЗагрузки");
	Макет.ОтображатьСетку = Истина;
	ТабличныйДокумент.Вывести(Макет);
	ТабличныйДокумент.ОтображатьСетку 	= Истина;
	ТабличныйДокумент.Защита 			= Ложь;
	
КонецПроцедуры
